1) What do you mean by "due to a UUID in the virtual_disk_id"???
2) Please explain your "side note"...   What "dummy change are you doing that you don't expect it to reboot?
3) I wasn't able to reproduce any of your problems...
```
[root@dev 12.example2]# terraform_0.12.16 plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # esxi_guest.myvm will be created
  + resource "esxi_guest" "myvm" {
      + boot_disk_size         = "8"
      + boot_disk_type         = "zeroedthick"
      + disk_store             = "DS_3TB"
      + guest_name             = "MyVM"
      + guest_shutdown_timeout = (known after apply)
      + guest_startup_timeout  = (known after apply)
      + guestos                = "centos7-64"
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + memsize                = "4096"
      + notes                  = (known after apply)
      + numvcpus               = "4"
      + ovf_properties_timer   = (known after apply)
      + power                  = "on"
      + resource_pool_name     = (known after apply)
      + virthwver              = "14"

      + network_interfaces {
          + mac_address     = (known after apply)
          + nic_type        = "vmxnet3"
          + virtual_network = "192.168.1"
        }

      + virtual_disks {
          + slot            = "0:1"
          + virtual_disk_id = (known after apply)
        }
    }

  # esxi_virtual_disk.myvm_swap will be created
  + resource "esxi_virtual_disk" "myvm_swap" {
      + id                      = (known after apply)
      + virtual_disk_dir        = "Terraform"
      + virtual_disk_disk_store = "DS_3TB"
      + virtual_disk_name       = "myvm_swap.vmdk"
      + virtual_disk_size       = 1
      + virtual_disk_type       = "zeroedthick"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


[root@dev 12.example2]# terraform_0.12.16 apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # esxi_guest.myvm will be created
  + resource "esxi_guest" "myvm" {
      + boot_disk_size         = "8"
      + boot_disk_type         = "zeroedthick"
      + disk_store             = "DS_3TB"
      + guest_name             = "MyVM"
      + guest_shutdown_timeout = (known after apply)
      + guest_startup_timeout  = (known after apply)
      + guestos                = "centos7-64"
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + memsize                = "4096"
      + notes                  = (known after apply)
      + numvcpus               = "4"
      + ovf_properties_timer   = (known after apply)
      + power                  = "on"
      + resource_pool_name     = (known after apply)
      + virthwver              = "14"

      + network_interfaces {
          + mac_address     = (known after apply)
          + nic_type        = "vmxnet3"
          + virtual_network = "192.168.1"
        }

      + virtual_disks {
          + slot            = "0:1"
          + virtual_disk_id = (known after apply)
        }
    }

  # esxi_virtual_disk.myvm_swap will be created
  + resource "esxi_virtual_disk" "myvm_swap" {
      + id                      = (known after apply)
      + virtual_disk_dir        = "Terraform"
      + virtual_disk_disk_store = "DS_3TB"
      + virtual_disk_name       = "myvm_swap.vmdk"
      + virtual_disk_size       = 1
      + virtual_disk_type       = "zeroedthick"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

esxi_virtual_disk.myvm_swap: Creating...
esxi_virtual_disk.myvm_swap: Creation complete after 2s [id=/vmfs/volumes/DS_3TB/Terraform/myvm_swap.vmdk]
esxi_guest.myvm: Creating...
esxi_guest.myvm: Still creating... [10s elapsed]
esxi_guest.myvm: Still creating... [20s elapsed]
esxi_guest.myvm: Still creating... [30s elapsed]
esxi_guest.myvm: Still creating... [40s elapsed]
esxi_guest.myvm: Still creating... [50s elapsed]
esxi_guest.myvm: Still creating... [1m0s elapsed]
esxi_guest.myvm: Still creating... [1m10s elapsed]
esxi_guest.myvm: Still creating... [1m20s elapsed]
esxi_guest.myvm: Still creating... [1m30s elapsed]
esxi_guest.myvm: Still creating... [1m40s elapsed]
esxi_guest.myvm: Still creating... [1m50s elapsed]
esxi_guest.myvm: Still creating... [2m0s elapsed]
esxi_guest.myvm: Still creating... [2m10s elapsed]
esxi_guest.myvm: Still creating... [2m20s elapsed]
esxi_guest.myvm: Creation complete after 2m27s [id=345]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.


[root@dev 12.example2]# terraform_0.12.16 plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

esxi_virtual_disk.myvm_swap: Refreshing state... [id=/vmfs/volumes/DS_3TB/Terraform/myvm_swap.vmdk]
esxi_guest.myvm: Refreshing state... [id=345]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.


[root@dev 12.example2]# terraform_0.12.16 refresh
esxi_virtual_disk.myvm_swap: Refreshing state... [id=/vmfs/volumes/DS_3TB/Terraform/myvm_swap.vmdk]
esxi_guest.myvm: Refreshing state... [id=345]


[root@dev 12.example2]# terraform_0.12.16 plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

esxi_virtual_disk.myvm_swap: Refreshing state... [id=/vmfs/volumes/DS_3TB/Terraform/myvm_swap.vmdk]
esxi_guest.myvm: Refreshing state... [id=345]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.


[root@dev 12.example2]# terraform_0.12.16 apply
esxi_virtual_disk.myvm_swap: Refreshing state... [id=/vmfs/volumes/DS_3TB/Terraform/myvm_swap.vmdk]
esxi_guest.myvm: Refreshing state... [id=345]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.   (This did not reboot my VM)


```